{
  "name": "Sudden increase in latency for a fraction of all requests",
  "description": "Detects a rapid increase in the given latency KPI percentile relative to the KPIs values in the last 30 minutes. The magnitude of the increase in latency should also exceed the relative and absolute threshold parameters below.
This rule is powered by a generic sudden drop/increase detector which is based on a modified version of the E-Divisive with Medians (EDM) algorithm for detection of changes in distribution of values of a given metric over the time.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. Review the documentation for the application or service experiencing the issue. This may provide information on any known issues or workarounds.
2. Check the system logs for any error messages or warnings related to high latency.
3. Investigate whether there are any patterns or trends in the latency data, such as spikes during specific times or after particular events.
4. If the issue persists, consider increasing the monitoring frequency for the latency KPI to more frequently alert on any sudden increases.
5. Adjust the relative and absolute threshold parameters for the latency KPI to better match the expected range of values for your environment.
6. Implement a mitigation strategy for the identified issue, such as optimizing the application code, adding caching layers, or scaling the system to handle increased traffic.
7. Monitor the latency KPI and other relevant metrics to ensure that the issue has been fully resolved and that no new issues have emerged.
8. Document the resolution process and any lessons learned for future reference.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["5F1zie2neePMiLsNpXTnDsrHXAs"]
      }
    ]
  }
}