{
  "name": "Too much CPU usage by user processes",
  "description": "Checks whether CPU usage of user processes is too high.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. Check for and address any resource-intensive background applications or services that may be consuming excessive CPU resources. This could include unnecessary background updates, email checks, or system maintenance tasks.
 2. Ensure that your system's hardware components are in good working order and not overheating. High temperatures can significantly impact CPU performance and contribute to high CPU usage.
 3. Monitor CPU usage over time to identify any patterns or spikes that may indicate underlying issues such as malware infections, driver conflicts, or software bugs.
 4. Update your operating system and drivers to the latest versions, as outdated software can sometimes cause unexpected CPU usage spikes.
 5. Consider using process monitoring tools or Task Manager (Windows) or Activity Monitor (Mac) to identify the specific processes causing the high CPU usage. You can then take appropriate action, such as ending the process, restarting it, or investigating potential issues with the application.
 6. If the high CPU usage persists after addressing these steps, consider running a full system scan using an antivirus program to check for any malware infections that may be consuming excessive CPU resources.
 7. If the issue continues to persist, you may want to consult with a technical support professional for further assistance. They can help you diagnose and address any underlying hardware or software issues that may be contributing to the high CPU usage.

By following these steps, you should be able to resolve the Too much CPU usage by user processes issue and improve overall system performance.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["roILHzyaMBRDZE3FxaeZ5T_wx4Q"]
      }
    ]
  }
}