{
  "name": "System load too high",
  "description": "Checks whether the system load is too high, by comparing the load against 2 times the CPU cores of the machine.",
  "type": "MANUAL",
  "tags": [
    "container",
    "docker",
    "podman",
    "cpu",
    "diagnostic",
    "watsonx"
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": "
1. Check for and remove any unnecessary background applications or services that may be consuming excessive resources. This includes closing unnecessary browser tabs, terminating unused virtual machines, and stopping resource-intensive processes.
2. Adjust your system's settings to optimize performance. This may include reducing visual effects, disabling unnecessary startup programs, and limiting the number of concurrent network connections.
3. Monitor system resource usage regularly to identify any patterns or spikes in resource consumption. This can help you detect and address potential issues before they become critical.
4. Consider upgrading your hardware if necessary. If your system is running on an older or underpowered hardware, it may struggle to handle high loads, leading to the "System load too high" error.
5. Implement load balancing techniques if you are running multiple servers or applications. By distributing workloads evenly across your infrastructure, you can prevent individual servers from becoming overwhelmed and maintain optimal performance levels.
6. Regularly update and patch your operating system and software to ensure that you have the latest security updates and bug fixes. Outdated software can sometimes cause unexpected performance issues, including high system loads.
7. Consult with a systems administrator or IT professional if you continue to experience issues after attempting these troubleshooting steps. They can provide more advanced diagnostic tools and expertise to help identify and resolve the root cause of the problem.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["xVYe3fW8kxjF3SbHfHdDxuycoB8"]
      }
    ]
  }
}