{
  "name": "CPU usage too high",
  "description": "Checks whether the CPU usage exceeds the configured threshold",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. Monitor CPU usage: Use tools like top or htop to monitor the current CPU usage of your MongoDB instance. This will help you identify if any process is consuming a significant amount of CPU resources.
 2. Check for resource contention: If multiple processes are consuming high CPU resources, it could be due to resource contention. You can use commands like 'ps' or 'top' to check for such situations.
 3. Adjust resource allocation: Based on your monitoring results, adjust the resource allocation for your MongoDB instance. You can increase the memory limit or vCPUs depending on your requirements and available resources.
 4. Optimize queries: If your application uses inefficient queries, it can lead to high CPU usage. Review and optimize your queries to improve performance.
 5. Implement caching: Caching frequently used data can significantly reduce the number of database operations and lower CPU usage.
 6. Update software: Ensure that your MongoDB instance and all related software are up-to-date. Outdated versions may have bugs or performance issues that contribute to high CPU usage.
 7. Scale horizontally: If your workload requires more resources, consider scaling your MongoDB deployment horizontally by adding more nodes.
 8. Investigate abnormal behavior: If none of the above steps resolve the issue, investigate any abnormal behavior in your system, such as unexpected crashes or slow response times. These could indicate underlying hardware or software issues.

By following these steps, you should be able to identify and address the root cause of high CPU usage in your MongoDB instance.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["0Bw3NX3bGUBQaYw2GDKZkO4TaRc"]
      }
    ]
  }
}