{
  "name": "Pull traffic is close to exceeding quota",
  "description": "Checks for pull traffic exceeding quota",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. Analyze the current usage of your registry and identify the pod that is causing the high pull traffic. You can use the command `kubectl top pods` to view the resource utilization of all pods in your cluster.
2. Once you have identified the problematic pod, check its resource utilization specifically by running the command `kubectl top pod <pod-name> -n <namespace> -l node-role.kubernetes.io/worker`. This will show you the CPU and memory usage of the worker nodes hosting the pod.
3. If the pod's resource utilization is consistently high, consider increasing the resources allocated to the pod. You can do this by modifying the container's resource limits in the pod's YAML file. For example, you can increase the CPU request and memory limit values. However, be cautious not to overcommit resources on the node, as this could lead to performance issues or even crashes for other workloads.
4. Another potential solution is to scale down the number of replicas for the application or service associated with the pod. Reducing the replica count will lower the overall pull traffic generated by the application.
5. Lastly, if none of the above steps resolve the issue, you may need to contact IBM Support for further assistance. They can help you investigate the root cause of the high pull traffic and provide guidance on how to address it.

It is important to note that regularly monitoring and managing your registry's traffic and resource utilization can help prevent such issues from occurring in the future. By staying proactive, you can ensure optimal performance and stability for your containerized applications.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["Pmhzn5c6KU_HT67Q3e_zLjytJWc"]
      }
    ]
  }
}