{
  "name": "GCP Pub/Sub Subscription push request latency",
  "description": "Push request latency increased significantly in last 10 minutes.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. **Check the subscription's configuration**: Ensure that the subscription is properly configured with the correct topic and message retention settings. A misconfigured subscription can lead to increased latency.
 2. **Inspect the Pub/Sub system**: Monitor the overall health of the Pub/Sub system by checking the number of active subscriptions, messages, and error rates. If the system is experiencing high traffic or resource constraints, it might cause increased latency.
 3. **Investigate message size**: Analyze the average message size and ensure it does not exceed the maximum allowed limit. Large messages can cause delays in processing and pushing requests.
 4. **Optimize push request frequency**: Adjust the frequency of push requests to balance between responsiveness and resource utilization. Frequent push requests can strain the system, while infrequent ones may result in increased latency due to accumulated backlog.
 5. **Implement retry mechanisms**: Implement retry logic for failed push requests to handle transient issues and prevent them from causing prolonged latency. This can help maintain consistent performance even during unexpected situations.
 6. **Monitor and analyze logs**: Regularly review Pub/Sub log data to identify any patterns or trends that may indicate underlying issues. Logs can provide valuable insights into the root cause of latency concerns and help you take appropriate action.
 7. **Update Pub/Sub client library**: Ensure your application uses the latest version of the Pub/Sub client library. Outdated libraries may have bugs or limitations that could contribute to increased latency.
 8. **Optimize network infrastructure**: Assess your network infrastructure for potential bottlenecks or connectivity issues. Slow or unreliable network connections can negatively impact push request latency.
 9. **Consider scaling**: If the above steps do not resolve the issue, consider scaling the Pub/Sub system by adding more resources (e.g., vCPUs, memory) or increasing the number of Pub/Sub instances. This can help improve latency and accommodate higher",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["BhQ_wl36GViPOyYpplaVp-tJCv8"]
      }
    ]
  }
}