{
  "name": "IBM MQ Transmission Queue high",
  "description": "IBM MQ Transmission Queue high.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": "   1. Check the queue manager's status: Ensure that the queue manager is running and not in a stopped or abnormal state. You can use the command "mqstat" to check the status of the queue manager.
   2. Verify the transmission queue depth: Use the command "showmq mqm(your_queue_manager) qmgr(your_queue_manager) q(your_transmission_queue)" to view the current depth of your transmission queue. If the depth is consistently high, it might indicate an issue with the application or message flow.
   3. Monitor message flow: Analyze the message flow and ensure that messages are being processed efficiently. You may need to adjust the message processing rate or implement error handling mechanisms to prevent overloading the transmission queue.
   4. Review application performance: Investigate the performance of the applications using the transmission queue. Look for bottlenecks, such as slow performing functions or inefficient algorithms, which could be contributing to the high queue depth.
   5. Implement queue prioritization: If necessary, prioritize specific messages or applications to ensure that critical messages are processed first. This can help reduce the overall queue depth and improve message flow efficiency.
   6. Adjust channel settings: Review the channel settings related to the transmission queue, such as the message retrieval interval and acknowledgement settings. Make sure they are optimized for your environment and application requirements.
   7. Check for dead letters: Dead letters are messages that cannot be delivered due to errors. Identifying and addressing dead letters can help reduce the number of messages in the transmission queue and improve overall system performance.
   8. Update queue manager software: Ensure that the queue manager software is up-to-date, as this can help address any known issues or bugs related to high transmission queues.
   9. Consult documentation and support resources: For further assistance, refer to the official IBM MQ documentation and",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["vO0mMkZ4-pXduOwd1qW2lCqaxoY"]
      }
    ]
  }
}