{
  "name": "Dead-letter queue size is growing",
  "description": "Dead-letter queue is filling. Messages being sent cannot be routed to their correct destination",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": "
1. **Check network connectivity**: Ensure that your broker and clients are able to communicate over the network. You can use tools like `telnet` or `nc` to check if the connections are open.
2. **Inspect message flow**: Look at the message flow between your producer and consumer applications. Check for any exceptions or errors that might be causing messages to be delivered to the dead-letter queue.
3. **Increase the number of redelivery attempts**: By default, ActiveMQ allows only 5 redelivery attempts before moving a message to the dead-letter queue. You can increase this value by modifying the `maxRedeliveries` property in the message listener configuration. This may help prevent messages from being stuck in the dead-letter queue due to transient issues.
4. **Clear the dead-letter queue**: If none of the above steps resolve the issue, you can manually clear the dead-letter queue using the appropriate command based on your messaging system's implementation. For example, in Apache ActiveMQ, you can use the `deleteQueue` command to remove the dead-letter queue.
5. **Update your software**: If the issue persists after trying the above steps, it might be a good idea to update your messaging software to the latest version. This could potentially address any bugs or compatibility issues that might be contributing to the problem.

By following these steps, you should be able to diagnose and resolve the issue with the growing dead-letter queue size.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["-z1UxhxsPxV0gnKtxxB00l6UaHM"]
      }
    ]
  }
}