{
  "name": "Number of active connections is close to the max",
  "description": "Used connections ratio exceeds the configured used connections ration threshold",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. Check your server's resources and ensure that it has enough memory and CPU power to handle the current number of connections. You can use tools like top, htop, or sar to monitor system resource usage.
2. If your server's resources are sufficient, consider increasing the maximum number of connections allowed by Nginx. To do this, modify the `nginx.conf` file and locate the `worker_processes` directive. Change the value to a higher number, such as 8 or more. This will allow Nginx to handle more concurrent requests.
3. Another solution is to increase the size of the worker_rlimit_nofile setting in the `nginx.conf` file. This will allow Nginx to keep more open files per process, which can help accommodate more concurrent connections. However, be cautious not to set this value too high, as it may cause issues with low-memory systems. A common recommendation is to set it to 512000 or higher.
4. If you're using an Nginx reverse proxy, consider increasing the buffer size for upstream buffers. This can help reduce the number of active connections and improve overall performance. The buffer size can be adjusted in the `proxy_buffer_size` directive within the `nginx.conf` file.
5. Lastly, if none of the above solutions work, you may need to implement connection limiting or rate limiting mechanisms. This can help prevent any single client from consuming excessive resources and ensure fair distribution of connections across clients. Implementing rate limiting can be done using the `limit_req` module in Nginx.

By following these steps, you should be able to resolve the "Number of active connections is close to the max" issue in Nginx.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["1RNxy7n8ntyHXkj71eKUJNWTmJM"]
      }
    ]
  }
}