{
  "name": "GCP Pub/Sub Topic oldest message",
  "description": "GCP Pub/Sub oldest message.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. **Check the project and topic names**: Ensure that the project and topic names are spelled correctly and match the ones used in your application.
 2. **Inspect the subscription**: Verify that the subscription is properly configured and associated with the correct topic. You may need to check the subscription's `topic_name`, `project_id`, and `push_config`.
 3. **Review the logs**: Look for any error messages or warnings related to the Pub/Sub service. These logs can provide valuable information about the cause of the issue.
 4. **Update the client library**: If you're using an outdated client library, consider updating it to the latest version. This might fix any compatibility issues or bugs that could be causing the problem.
 5. **Restart the Pub/Sub server**: In some cases, restarting the Pub/Sub server can help resolve the issue. To do this, open a terminal window and run the command "gcloud components update pubsub".
 6. **Clear the Pub/Sub subscription cache**: If none of the above steps work, you can try clearing the Pub/Sub subscription cache. To do this, execute the command "gcloud beta pubsub subscriptions reset-cache".
 7. **Investigate network connectivity issues**: Ensure that there are no network connectivity issues between your application and the Pub/Sub service.
 8. **Try a different instance**: If the issue persists, try deploying your application to a different instance or region to see if the problem is isolated to the original instance.

If you continue to experience issues, please provide more context about your environment and the specific error message you are encountering. This will help me better understand the situation and provide more targeted assistance.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["OZ9LmfR4DS-fNEm4xyANAyTQ_OE"]
      }
    ]
  }
}