{
  "name": "Allocatable pod count too low",
  "description": "Allocated pods percentage is approaching the configured threshold. For a namespace pods in the phases 'Pending', 'Running' and 'Unknown' are counted as allocated.",
  "type": "MANUAL",
  "tags": [
     ""
  ],
  "fields": [
    {
        "name": "content",
        "description": "Content for manual action",
        "encoding": "base64",
        "value": " 1. **Resize your cluster**: If you have spare capacity in your Kubernetes cluster, you can increase the number of available nodes to accommodate more pods. This will provide additional resources for your applications to run smoothly.

 2. **Optimize your workload**: Analyze your application's resource requirements and optimize its configuration to reduce resource consumption. This may include optimizing container sizes, minimizing resource-intensive processes, or adjusting scheduling policies.

 3. **Scale down unnecessary workloads**: Identify and scale down any non-critical or low-priority workloads that may be consuming excessive resources. This will help free up resources for critical applications and improve overall cluster performance.

 4. **Implement resource quotas**: Set resource limits on namespaces to prevent individual workloads from consuming disproportionate amounts of resources. This ensures fair distribution of resources and prevents any single workload from causing issues with allocatable pod counts.

 5. **Monitor and alert**: Continuously monitor your cluster's resource usage and set up alerts for when the Allocatable pod count approaches the threshold. This will allow you to take proactive measures to address potential issues before they become critical.

By following these steps, you can effectively manage your Kubernetes cluster's resources and ensure that all workloads have access to the necessary resources while maintaining optimal performance levels.",
        "secured": false
    }
],
  "staticId": "containerCPUDebug",
  "metadata": {
    "ai": [
      {
        "algorithm": "watsonx",
        "events": ["lv8EiCeXbbArFF6l4i4jp4hA74Q"]
      }
    ]
  }
}